Repository: Yes-lan/e-CO_Mobile
Catalog: lib/l10n/app_*.arb
Languages: eu, fr

source: Welcome
eu: Ongi etorri
fr: Bienvenue

# chooseProfile
source: Choose your profile
eu: Aukeratu zure profila
fr: Choisissez votre profil

source: Teacher
eu: Irakaslea
fr: Professeur

# teacherDescription
source: Manage courses and races
eu: Kudeatu ibilbideak eta lasaiketa-korrikak
fr: Gérer les parcours et courses

source: Participant
eu: Parte-hartzailea

# participantDescription
source: Join a race
eu: Korrikara batu
fr: Rejoindre une course

# appTitle
source: eCO - Orienteering Race
eu: eCO - Orientazio Lasterketa
fr: eCO - Course d'Orientation

source: French
eu: Frantsesa
fr: Français

source: English
eu: Ingelesa
fr: Anglais

source: Basque
eu: Euskara

source: Select language
eu: Hizkuntza hautatu
fr: Sélectionner la langue

# teacherLoginTitle
source: Teacher Login
eu: Irakaslearen saioa hasi
fr: Connexion Professeur

# teacherLoginSubtitle
source: Access your routes and races
eu: Sartu zure ibilbide eta saioetara
fr: Accédez à vos parcours et sessions

source: Email
eu: E-posta

# emailHint
source: example@mail.com
eu: adibidea@posta.eus
fr: exemple@mail.com

source: Password
eu: Pasahitza
fr: Mot de passe

# pleaseEnterEmail
source: Please enter your email
eu: Mesedez, sartu zure e-posta
fr: Veuillez entrer votre email

source: Invalid email
eu: E-posta baliogabea
fr: Email invalide

# pleaseEnterPassword
source: Please enter your password
eu: Mesedez, sartu zure pasahitza
fr: Veuillez entrer votre mot de passe

# passwordMinLength
source: Password must contain at least 6 characters
eu: Pasahitzak gutxienez 6 karaktere izan behar ditu
fr: Le mot de passe doit contenir au moins 6 caractères

# loginButton
source: Log in
eu: Saioa hasi
fr: Se connecter

source: Login error
eu: Saioa hasteko errorea
fr: Erreur de connexion

# error
source: Error: {message}
eu: Errorea: {message}
fr: Erreur: {message}

# teacherHomeTitle
source: Teacher Space
eu: Irakaslearen gunea
fr: Espace Professeur

source: Logout
eu: Saioa itxi
fr: Déconnexion

# logoutConfirmTitle
source: Logout
eu: Saioa itxi
fr: Déconnexion

# logoutConfirmMessage
source: Do you really want to log out?
eu: Benetan saioa itxi nahi duzu?
fr: Voulez-vous vraiment vous déconnecter ?

source: Cancel
eu: Ezeztatu
fr: Annuler

# coursesTab
source: Races
eu: Korrikak
fr: Courses

# routesTab
source: Routes
eu: Ibilbideak
fr: Parcours

source: ✅ Session closed
eu: ✅ Saioa itxita
fr: ✅ Session clôturée

# closeSessionError
source: Error while closing
eu: Errorea ixtean
fr: Erreur lors de la clôture

# noCompletedSessions
source: No completed races
eu: Ez dago amaitutako korrikarik
fr: Aucune course terminée

# participants
source: {count} participant(s)
eu: {count} parte-hartzaile

# duration
source: Duration: {hours}h {minutes}min
eu: Iraupena: {hours}h {minutes}min
fr: Durée: {hours}h {minutes}min

# createSession
source: Create a race
eu: Korrika sortu
fr: Créer une course

source: Close session
eu: Saioa itxi
fr: Clôturer la session

# closeSessionConfirm
source: Do you really want to close the session "{name}"? This action is irreversible.
eu: Benetan "{name}" saioa itxi nahi duzu? Ekintza hau itzulezina da.
fr: Voulez-vous vraiment clôturer la session "{name}" ? Cette action est irréversible.

source: Close
eu: Itxi
fr: Clôturer

# noCourses
source: No routes
eu: Ez dago ibilbiderik
fr: Aucun parcours

source: Draft
eu: Zirriborroa
fr: Brouillon

source: Placement in progress
eu: Kokapena abian
fr: Placement en cours

source: Ready
eu: Prest
fr: Prêt

source: In progress
eu: Abian
fr: En cours

source: Completed
eu: Amaituta
fr: Terminé

source: Archived
eu: Artxibatuta
fr: Archivé

# createSessionTitle
source: Create a race
eu: Korrika sortu
fr: Créer une course

# sessionName
source: Race name
eu: Korrikaren izena
fr: Nom de la course

# sessionNameHint
source: Ex: December 9th race
eu: Ad: Abenduaren 9ko korrika
fr: Ex: Course du 9 décembre

# selectRoute
source: Select a route
eu: Ibilbidea hautatu
fr: Sélectionner un parcours

# readyRoutes
source: Ready routes (most recent first)
eu: Ibilbide prest (berriena lehenik)
fr: Parcours prêts (plus récents en premier)

# pleaseEnterName
source: Please enter a name
eu: Mesedez, sartu izena
fr: Veuillez entrer un nom

# pleaseSelectRoute
source: Please select a route
eu: Mesedez, hautatu ibilbidea
fr: Veuillez sélectionner un parcours

source: No ready routes
eu: Ez dago ibilbiderik prest
fr: Aucun parcours prêt

# needToPlaceBeacons
source: You must first create and place the beacons for a route
eu: Lehenik ibilbide baten balizak sortu eta kokatu behar dituzu
fr: Vous devez d'abord créer et placer les balises d'un parcours

source: Back
eu: Atzera
fr: Retour

source: No description
eu: Deskribapenik ez
fr: Pas de description

# createAndLaunch
source: Create and launch race
eu: Korrika sortu eta abiarazi
fr: Créer et lancer la course

source: Creating...
eu: Sortzen...
fr: Création...

# creationError
source: Error during creation
eu: Errorea sortzean
fr: Erreur lors de la création

# beaconsPlaced
source: {placed}/{total} beacons placed
eu: {placed}/{total} balizak kokatuak
fr: {placed}/{total} balises placées

# scanner
source: Scan
eu: Skanatu
fr: Scanner

source: Beacons
eu: Balizak
fr: Balises

source: Start
eu: Hasi
fr: Départ

source: Finish
eu: Amaitu
fr: Terminer

source: Control beacons
eu: Kontrol balizak
fr: Balises de contrôle

source: Confirm placement
eu: Kokapen berretsi
fr: Confirmer le placement

# beacon
source: Beacon: {name}
eu: Baliza: {name}
fr: Balise: {name}

source: GPS position:
eu: GPS kokapena:
fr: Position GPS:

source: Confirm
eu: Berretsi
fr: Confirmer

# beaconPlaced
source: ✅ {name} placed
eu: ✅ {name} kokatuta
fr: ✅ {name} placée

source: Placement error
eu: Errorea kokatzean
fr: Erreur lors du placement

# allBeaconsPlaced
source: ✅ All beacons placed! Route ready.
eu: ✅ Balizak guztiak kokatuak! Ibilbidea prest.
fr: ✅ Toutes les balises sont placées ! Parcours prêt.

# gpsDisabled
source: GPS is disabled. Please enable it.
eu: GPSa desaktibatuta dago. Mesedez, aktibatu ezazu.
fr: Le GPS est désactivé. Veuillez l'activer.

source: Location permission denied
eu: Kokapen baimena ukatuta
fr: Permission de localisation refusée

# locationPermissionDeniedForever
source: Location permission permanently denied.
eu: Kokapen baimena behin betiko ukatuta.
fr: Permission de localisation refusée définitivement.

# alreadyPlaced
source: This beacon is already placed
eu: Baliza hau dagoeneko kokatuta dago
fr: Cette balise est déjà placée

# cannotGetPreciseLocation
source: Unable to get a precise GPS position
eu: Ezin da GPS kokapen zehatza lortu
fr: Impossible d'obtenir une position GPS précise

# scanQRCode
source: Scan the beacon's QR code
eu: Skanatu balizaren QR kode
fr: Scannez le QR code de la balise

# precisePositioning
source: Precise positioning in progress
eu: Kokapen zehatza abian
fr: Positionnement précis en cours

# type
source: Type: {type}
eu: Mota: {type}

# status
source: Status: {status}
eu: Egoera: {status}
fr: Statut: {status}

source: ✅ Placed
eu: ✅ Kokatuta
fr: ✅ Placée

source: ⏳ To place
eu: ⏳ Kokatzeko
fr: ⏳ À placer

# placedOn
source: Placed on: {date}
eu: Kokatuta: {date}
fr: Placée le: {date}

# closeButton
source: Close
eu: Itxi
fr: Fermer

# joinSession
source: Join a race
eu: Korrikara batu
fr: Rejoindre une course

# chooseJoinMethod
source: Choose how to join
eu: Aukeratu nola batu
fr: Choisissez comment rejoindre

# scanQRCodeButton
source: Scan QR Code
eu: QR kode skanatu
fr: Scanner le QR Code

# scanStartBeacon
source: Scan the start beacon
eu: Abiapuntuko baliza skanatu
fr: Scannez la balise de départ

source: Enter code
eu: Kode sartu
fr: Entrer le code

source: Enter session code
eu: Sesio kode sartu
fr: Saisir le code de session

# scanBeaconTitle
source: Scan beacon
eu: Baliza skanatu
fr: Scanner la balise

# enterYourName
source: Enter your nickname
eu: Sartu zure ezizena
fr: Entrez votre pseudo

source: Your name
eu: Zure izena
fr: Votre nom

source: Validate
eu: Balioztatu
fr: Valider

# placeQRCodeInFrame
source: Place the start beacon's QR code in the frame
eu: Jarri abiapuntuko balizaren QR kode esparru honetan
fr: Placez le QR code de la balise de départ dans le cadre

# notStartBeacon
source: This QR code does not correspond to a start beacon
eu: QR kode hau ez dator bat abiapuntuko balizarekin
fr: Ce QR code ne correspond pas à une balise de départ

# scanError
source: Scan error: {error}
eu: Errorea skanatzerakoan: {error}
fr: Erreur lors du scan: {error}

# enterCodeTitle
source: Enter code
eu: Kode sartu
fr: Entrer le code

# enterCodeSubtitle
source: Enter the race code
eu: Sartu korrikaren kode
fr: Saisissez le code de la course

# sessionCode
source: Race code
eu: Korrikaren kode
fr: Code de course

# sessionCodeHint
source: Ex: ABC123
eu: Ad: ABC123

# yourPseudo
source: Your nickname
eu: Zure ezizena
fr: Votre pseudo

# yourPseudoHint
source: Ex: John
eu: Ad: Jon
fr: Ex: Jean

# pleaseEnterPseudo
source: Please enter your nickname
eu: Mesedez, sartu zure ezizena
fr: Veuillez entrer votre pseudo

# pleaseEnterCode
source: Please enter the code
eu: Mesedez, sartu kode
fr: Veuillez entrer le code

source: Invalid session code
eu: Saio kode baliogabea
fr: Code de session invalide

source: Join
eu: Batu
fr: Rejoindre

# raceTitle
source: Race - {name}
eu: Korrika - {name}
fr: Course - {name}

source: Progress
eu: Aurrerapena
fr: Progression

# beaconsCount
source: {scanned} / {total} beacons
eu: {scanned} / {total} balizak
fr: {scanned} / {total} balises

source: Scan beacon
eu: Baliza skanatu
fr: Scanner balise

source: 🎉 Congratulations!
eu: 🎉 Zorionak!
fr: 🎉 Félicitations !

# raceCompleted
source: You completed the race!
eu: Korrika osatu duzu!
fr: Vous avez terminé la course !

# alreadyScanned
source: Beacon already scanned
eu: Baliza dagoeneko skanatu
fr: Balise déjà scannée

# beaconScanned
source: Beacon {name} scanned ✓
eu: {name} baliza skanatu ✓
fr: Balise {name} scannée ✓

source: Arrival
eu: Helmuga
fr: Arrivée

source: Departure
eu: Abiapuntua
fr: Départ

# beaconLabel
source: Beacon
eu: Baliza
fr: Balise

source: Scanned ✓
eu: Skanatuta ✓
fr: Scannée ✓

source: To scan
eu: Skanatzeko
fr: À scanner
