Repository: Yes-lan/e-CO_Mobile
Catalog: assets/l10n/app_*.arb
Languages: eu

# appTitle
source: eCO - Orienteering Race
eu: eCO - Orientazio Lasterketa

source: Welcome
eu: Ongi etorri

# chooseProfile
source: Choose your profile
eu: Aukeratu zure profila

source: Teacher
eu: Irakaslea

# manageCourses
source: Manage courses and races
eu: Ibilbideak eta lasterketa kudeatu

source: Participant
eu: Parte-hartzailea

# joinCourse
source: Join a race
eu: Lasterketara sartu

source: Language
eu: Hizkuntza

source: Select language
eu: Hautatu hizkuntza

source: Teacher Login
eu: Irakasle Saioa

# accessCourses
source: Access your courses and sessions
eu: Atzitu zure ibilbideak eta sesio

# emailHint
source: example@mail.com
eu: adibidea@mail.com

source: Password
eu: Pasahitza

# invalidEmail
source: Please enter your email
eu: Idatzi zure email-a

# invalidEmailFormat
source: Invalid email
eu: Email baliogabea

# emptyPassword
source: Please enter your password
eu: Idatzi zure pasahitza

# shortPassword
source: Password must be at least 6 characters
eu: Pasahitzak gutxienez 6 karaktere izan behar ditu

source: Login
eu: Saioa hasi

# participantJoin
source: Join a race
eu: Lasterketara sartu

source: Choose how to join
eu: Nola sartzea nahi duzun hautatu

source: Scan QR Code
eu: QR kodea eskaneatu

# scanBeaconStart
source: Scan the start beacon
eu: Abiatze-farola eskanea

source: Enter code
eu: Kodea sartu

source: Enter session code
eu: Sesio kodea sartu

source: Enter your nickname
eu: Sartu zure ezizena

source: Your nickname
eu: Zure ezizena

# yourNicknameHint
source: ex: John
eu: adib: Jon

# scanStartBeacon
source: Scan the beacon
eu: Farola eskanea

source: Cancel
eu: Utzi

source: Validate
eu: Baieztatu

source: Session code
eu: Lasterketa kodea

# sessionCodeHint
source: ex: ABC123
eu: Adib: ABC123

source: Invalid session code
eu: Sesio kode baliogabea

source: Enter the code
eu: Kodea sartu

# selectYourCode
source: Enter the session code
eu: Sartu lasterketa kodea

source: Join race
eu: Sartu

source: Races
eu: Lasterketa

source: Courses
eu: Ibilbideak

# teacherHome
source: My Races
eu: Nire lasterketa

source: Logout
eu: Saioa itxi

# confirmLogout
source: Logout
eu: Saioa itxi

# confirmLogoutMessage
source: Do you really want to logout?
eu: Benetan saioa itxi nahi duzu?

source: No completed races
eu: Osatutako lasterketa ez

source: participants
eu: parte-hartzaile

source: Duration
eu: Iraupena

# gpsDisabled
source: GPS is disabled. Please enable it.
eu: GPS desaktibatuta dago. Aktibatu ezazu.

source: Location permission denied
eu: Kokalekuaren baimena ukatua

# locationPermissionDeniedForever
source: Location permission permanently denied.
eu: Kokalekuaren baimena betirako ukatua.

source: Error
eu: Akatsa

# createRace
source: Create a race
eu: Lasterketa sortu

source: Race name
eu: Lasterketa izena

# raceNameHint
source: ex: Race of December 9
eu: Adib: Abendu 9ko lasterketa

# selectCourse
source: Select a course
eu: Ibilbidea hautatu

# noCourseReady
source: No courses ready
eu: Prestaturiko ibilbiderik ez

# mustCreatePlaceBefore
source: You must first create and place the beacons of a course
eu: Lehenik eta behin ibilbide baten farolak sortu eta kokatu behar dituzu

source: Back
eu: Atzera

# noReady
source: No courses ready
eu: Prestaturiko ibilbiderik ez
